<script lang="ts" setup>
const items = [
  {
    label: "مخاطبین این دوره چه کسانی هستند؟",
    content: `
      تمامی کسانی که هیچ دانشی در مورد فریمورک های CSS ندارند.
تمامی کسانی که در حوزه فرانت‌اند مشغول یادگیری هستند.
تمامی کسانی که به دنبال موقعیت شغلی جذاب در حوزه فرانت‌اند هستند.
تمامی کسانی که قصد دارند یک مهارت ضروری و پرکاربرد را به رزومه خود اضافه کنند.
تمامی کسانی که می‌خواهند در مصاحبه‌های شغلی، شانس بیشتری برای پذیرفته شدن داشته باشند.
تمامی کسانی که با CSS آشنا شده‌اند و حالا قصد دارند محبوب‌ترین فریم‌ورک آن را یاد بگیرند.
      `,
  },
  {
    label: "آیا این دوره پیش نیاز خاصی دارد؟",
    content:
      "از آنجایی که این دوره در سطح مقدماتی تا متوسط تهیه شده است، تنها پیش نیاز این دوره برای شروع، آشنایی کافی با HTML و CSS است.",
  },
  {
    label: "در انتهای دوره چه دستاورد علمی و مهارتی خواهم داشت؟",
    content:
      "این دوره یکی از قدم‌های کلیدی در روند برنامه‌نویس فرانت‌اند شدن است. در طی این دوره پس از آشنایی با بوت‌استرپ و چگونگی نصب و راه‌اندازی، کاربردهای آن را به همراه مثال‌های عملی فرا خواهید گرفت و در طی این راه با کمک پروژه‌های عملی به درک مناسبی از آن‌ها خواهید رسید. در انتهای این دوره نیز قادر خواهید بود یک وبسایت را بطور کامل با استفاده از بوت‌استرپ پیاده‌سازی کنید.",
  },
  {
    label: "آیا امکان بازنشر این دوره از طریق دیگر سایت ها وجود دارد؟",
    content:
      "بر اساس قوانین سکان آکادمی، هر گونه بازنشر دوره‌های آموزشی بر خلاف قوانین سکان آکادمی است، از لحاظ شرعی حرام و از لحاظ حقوقی قابل پیگرد قانونی است.",
  },
];
</script>

<template>
  <UAccordion :items="items" size="xl" />
</template>

<style lang="scss" scoped></style>
