<script lang="ts" setup></script>

<template>
  <div>
    <UContainer>
      <div class="grid grid-cols-12 gap-12">
        <!-- Content -->
        <div class="col-span-8">
          <div class="mb-10">
            <h1 class="text-[2.5rem] font-bold">
              ۹۷ چیزی که هر برنامه‌نویسی باید بداند
            </h1>

            <div class="space-4 mt-2">
              <UButton
                color="black"
                variant="link"
                size="lg"
                icon="i-solar-layers-broken"
                label="اینترنت و شبکه"
                class="me-auto"
              />

              <UButton
                color="black"
                variant="link"
                size="lg"
                icon="i-solar-calendar-broken"
                label="یک ماه پیش"
                class="me-auto"
              />

              <UButton
                color="black"
                variant="link"
                size="lg"
                icon="i-solar-clock-square-broken"
                label="9 دقیقه"
                class="me-auto"
              />
            </div>
          </div>

          <p>
            پاکسازی (Data Cleaning) و پیش پردازش داده‌ها (Data pre-processing)
            یک امر ضرورى در علم داده است زیرا بدون داده‌هاى تمیز شده، نتایج هر
            مدل تحلیل داده یا یادگیری ماشین ممكن است نادرست باشد.
            <br />
            <br />
            در این دوره آموزشی، با تکنیک‌های ضروری پیش پردازش داده‌ها آشنا شده و
            نحوه شناسایى، تشخیص و اصلاح انواع مشكلات مربوط به پاکسازی داده‌ها را
            در پایتون، از ساده تا پیشرفته را یاد خواهید گرفت. پاکسازی (Data
            Cleaning) و پیش پردازش داده‌ها (Data pre-processing) یک امر ضرورى در
            علم داده است زیرا بدون داده‌هاى تمیز شده، نتایج هر مدل تحلیل داده یا
            یادگیری ماشین ممكن است نادرست باشد.
            <br />
            <br />
            در این دوره آموزشی، با تکنیک‌های ضروری پیش پردازش داده‌ها آشنا شده و
            نحوه شناسایى، تشخیص و اصلاح انواع مشكلات مربوط به پاکسازی داده‌ها را
            در پایتون، از ساده تا پیشرفته را یاد خواهید گرفت. پاکسازی (Data
            Cleaning) و پیش پردازش داده‌ها (Data pre-processing) یک امر ضرورى در
            علم داده است زیرا بدون داده‌هاى تمیز شده، نتایج هر مدل تحلیل داده یا
            یادگیری ماشین ممكن است نادرست باشد.
            <br />
            <br />
            در این دوره آموزشی، با تکنیک‌های ضروری پیش پردازش داده‌ها آشنا شده و
            نحوه شناسایى، تشخیص و اصلاح انواع مشكلات مربوط به پاکسازی داده‌ها را
            در پایتون، از ساده تا پیشرفته را یاد خواهید گرفت. پاکسازی (Data
            Cleaning) و پیش پردازش داده‌ها (Data pre-processing) یک امر ضرورى در
            علم داده است زیرا بدون داده‌هاى تمیز شده، نتایج هر مدل تحلیل داده یا
            یادگیری ماشین ممكن است نادرست باشد.
            <br />
            <br />
            در این دوره آموزشی، با تکنیک‌های ضروری پیش پردازش داده‌ها آشنا شده و
            نحوه شناسایى، تشخیص و اصلاح انواع مشكلات مربوط به پاکسازی داده‌ها را
            در پایتون، از ساده تا پیشرفته را یاد خواهید گرفت. پاکسازی (Data
            Cleaning) و پیش پردازش داده‌ها (Data pre-processing) یک امر ضرورى در
            علم داده است زیرا بدون داده‌هاى تمیز شده، نتایج هر مدل تحلیل داده یا
            یادگیری ماشین ممكن است نادرست باشد.
            <br />
            <br />
            در این دوره آموزشی، با تکنیک‌های ضروری پیش پردازش داده‌ها آشنا شده و
            نحوه شناسایى، تشخیص و اصلاح انواع مشكلات مربوط به پاکسازی داده‌ها را
            در پایتون، از ساده تا پیشرفته را یاد خواهید گرفت.
            <br />
            <br />
            در این دوره آموزشی، با تکنیک‌های ضروری پیش پردازش داده‌ها آشنا شده و
            نحوه شناسایى، تشخیص و اصلاح انواع مشكلات مربوط به پاکسازی داده‌ها را
            در پایتون، از ساده تا پیشرفته را یاد خواهید گرفت. پاکسازی (Data
            Cleaning) و پیش پردازش داده‌ها (Data pre-processing) یک امر ضرورى در
            علم داده است زیرا بدون داده‌هاى تمیز شده، نتایج هر مدل تحلیل داده یا
            یادگیری ماشین ممكن است نادرست باشد.
            <br />
            <br />
            در این دوره آموزشی، با تکنیک‌های ضروری پیش پردازش داده‌ها آشنا شده و
            نحوه شناسایى، تشخیص و اصلاح انواع مشكلات مربوط به پاکسازی داده‌ها را
            در پایتون، از ساده تا پیشرفته را یاد خواهید گرفت. پاکسازی (Data
            Cleaning) و پیش پردازش داده‌ها (Data pre-processing) یک امر ضرورى در
            علم داده است زیرا بدون داده‌هاى تمیز شده، نتایج هر مدل تحلیل داده یا
            یادگیری ماشین ممكن است نادرست باشد.
            <br />
            <br />
            در این دوره آموزشی، با تکنیک‌های ضروری پیش پردازش داده‌ها آشنا شده و
            نحوه شناسایى، تشخیص و اصلاح انواع مشكلات مربوط به پاکسازی داده‌ها را
            در پایتون، از ساده تا پیشرفته را یاد خواهید گرفت. پاکسازی (Data
            Cleaning) و پیش پردازش داده‌ها (Data pre-processing) یک امر ضرورى در
            علم داده است زیرا بدون داده‌هاى تمیز شده، نتایج هر مدل تحلیل داده یا
            یادگیری ماشین ممكن است نادرست باشد.
            <br />
            <br />
            در این دوره آموزشی، با تکنیک‌های ضروری پیش پردازش داده‌ها آشنا شده و
            نحوه شناسایى، تشخیص و اصلاح انواع مشكلات مربوط به پاکسازی داده‌ها را
            در پایتون، از ساده تا پیشرفته را یاد خواهید گرفت. پاکسازی (Data
            Cleaning) و پیش پردازش داده‌ها (Data pre-processing) یک امر ضرورى در
            علم داده است زیرا بدون داده‌هاى تمیز شده، نتایج هر مدل تحلیل داده یا
            یادگیری ماشین ممكن است نادرست باشد.
            <br />
            <br />
            در این دوره آموزشی، با تکنیک‌های ضروری پیش پردازش داده‌ها آشنا شده و
            نحوه شناسایى، تشخیص و اصلاح انواع مشكلات مربوط به پاکسازی داده‌ها را
            در پایتون، از ساده تا پیشرفته را یاد خواهید گرفت.
          </p>
        </div>

        <!-- Sidebar -->
        <div class="col-span-4">
          <div class="sticky top-28 space-y-6">
            <NuxtImg
              src="https://sokanacademy.s3.ir-thr-at1.arvanstorage.ir/30152/conversions/SSH-vs-HTTPS-small.webp"
              class="w-full h-56 border-2 rounded-xl"
            />

            <div class="border-2 rounded-xl px-4 py-3">
              <div class="flex gap-x-2">
                <UButton
                  color="gray"
                  variant="ghost"
                  size="lg"
                  icon="i-solar-dialog-2-broken"
                  label="دیدگاه شما"
                  class="me-auto"
                />

                <UButton
                  color="gray"
                  variant="ghost"
                  size="lg"
                  icon="i-solar-link-square-broken"
                />

                <UButton
                  color="gray"
                  variant="ghost"
                  size="lg"
                  icon="i-solar-share-outline"
                />
              </div>
            </div>
          </div>
        </div>
      </div>

      <div class="h-0.5 w-full bg-gray-300 mt-20"></div>

      <div class="space-y-32 mt-40">
        <div class="w-2/3 mx-auto">
          <BaseSectionTitle title="مطالب مرتبط" />

          <div class="space-y-8">
            <BlogCard />
            <BlogCard />
            <BlogCard />
          </div>
        </div>

        <div class="w-2/3 mx-auto">
          <BaseSectionTitle title="نویسنده" />

          <UserProfileCard />
        </div>

        <div class="w-2/3 mx-auto">
          <BaseSectionTitle title="دیدگاه شما" />

          <Comment />
        </div>
      </div>
    </UContainer>
  </div>
</template>

<style lang="scss" scoped></style>
